KanatERPSukhova.КанатАдаптация/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="91453e18-03ae-4724-8a0e-3401542ee57a">
      <name>ДокументОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_НТДНоменклатуры</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0e7e0970-627b-458f-8d96-ef13c523d2b8">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КАНАТКач_ВидДляКонтроляКачества</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1b521724-19bd-43e6-b544-b67dc4ba22b9">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ТекстДублиАртикулов</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_НеГенерироватьАртикул</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="97ef8ff9-68db-45ee-91be-54bfb600b3a1">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ОБъектБылИзменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_ПоказателиНТД</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Размерность</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Documents/ПриходныйОрдерНаТовары/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ Гурьев 29.08.23 Создание новых элементов формы для отображения свода товаров
	
	СтраницаСводТоваров = Элементы.Добавить(
		"КАНАТ_СтраницаСводТоваров",
		Тип("ГруппаФормы"),
		Элементы.ГруппаСтраницы);
	СтраницаСводТоваров.Вид = ВидГруппыФормы.Страница;
	СтраницаСводТоваров.Заголовок = "Товары свод";
	
	ДобавляемыеРеквизиты = Новый Массив;
	//Таблица Товары Свод
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КАНАТ_ТЗСводТоваров",
															 Новый ОписаниеТипов("ТаблицаЗначений")));
	
	//Колонки
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Номер",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "№"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Код",
															 Новый ОписаниеТипов("Строка"),
															 "КАНАТ_ТЗСводТоваров",
															 "Код"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("НоменклатураСсылка",
															 Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),
															 "КАНАТ_ТЗСводТоваров",
															 "Номенклатура"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ХарактеристикаСсылка",
															 Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),
															 "КАНАТ_ТЗСводТоваров",
															 "Характеристика"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Количество",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "Количество"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Вес",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "Вес"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЕдиницаИзмерения",
															 Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"),
															 "КАНАТ_ТЗСводТоваров",
															 "Ед. изм."));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Серии",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "Мест"));
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//Элементы формы Свод Таблица
	ТаблицаФормы = Элементы.Добавить("КАНАТ_ТЗСводТоваров", Тип("ТаблицаФормы"), Элементы.КАНАТ_СтраницаСводТоваров);
	ТаблицаФормы.ПутьКДанным = "КАНАТ_ТЗСводТоваров"; 
	ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ТаблицаФормы.ТолькоПросмотр = Истина;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровНомер", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "№"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Номер";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровКод", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Код"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Код";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровНоменклатура", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Номенклатура"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.НоменклатураСсылка";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровХарактеристика", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Характеристика"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.ХарактеристикаСсылка";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровКоличество", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Количество"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Количество";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровВес", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Вес"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Вес";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровЕдиницаИзмерения", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Ед. изм."; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.ЕдиницаИзмерения";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровНомерСерии", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Мест"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Серии";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	КАНАТ_ОбновитьТоварыСвод();
	
	КАНАТ_ОбновитьТоварыСвод();
	
	//-- Гурьев 30.08.23
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_ГруппаСтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	//++ Гурьев 30.08.23 Обновление свода товаров при смене страницы
	Если ТекущаяСтраница.Имя = "КАНАТ_СтранциаСводТоваров" Тогда
		КАНАТ_ОбновитьТоварыСвод();
	КонецЕсли;
	//-- Гурьев 30.08.23
КонецПроцедуры

//++ Гурьев 30.08.23 Процедура, обновляющая таблицу ТоварыСвод
&НаСервере
Процедура КАНАТ_ОбновитьТоварыСвод()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Вес КАК Вес,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Серия КАК Серия
	|ПОМЕСТИТЬ ВТБезГруппировки
	|ИЗ
	|	&Таблица КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.УпаковочныйЛист = ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК НоменклатураСсылка,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТовары.Вес) КАК Вес,
	|	СУММА(ТаблицаТовары.Количество) КАК Количество,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаТовары.Серия) КАК Серия
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТБезГруппировки КАК ТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Код КАК Код,
	|	ВТ.НоменклатураСсылка КАК НоменклатураСсылка,
	|	ВТ.Характеристика КАК ХарактеристикаСсылка,
	|	ВТ.Количество КАК Количество,
	|	ВТ.Вес КАК Вес,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ.Серия КАК Серии
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВТ.Характеристика = ХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ.НоменклатураСсылка = Номенклатура.Ссылка";
	
	Запрос.УстановитьПараметр("Таблица", Объект.Товары.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Счетчик = 0;
	
	ЭтотОбъект.КАНАТ_ТЗСводТоваров.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Счетчик = Счетчик + 1;
		
		Строка = ЭтотОбъект.КАНАТ_ТЗСводТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		Строка.Номер = Счетчик;
		
	КонецЦикла;
	
КонецПроцедуры 
//-- Гурьев 30.08.23
